In [2]:
import numpy as np 
import pandas as pd

In [6]:
  dict1={
      "name":['harry','rohan','skillf','shubh'],
      "marks":[92,34,12,76],
      "city":['kolkata','delhi','mumbai','aurangabad']      #sample data.
        }

In [7]:
df = pd.DataFrame(dict1)  #this will make a dataframe. this will convert the data to excel sheet for faster indexing.

In [9]:
print(df) #index,name,marks,column

     name  marks        city
0   harry     92     kolkata
1   rohan     34       delhi
2  skillf     12      mumbai
3   shubh     76  aurangabad

In [13]:
df.to_csv('friends.csv') #will covert the data to a csv(excel) file.

In [15]:
df.to_csv('friends_indexFalse.csv',index=False) #same,but no indexing now in excel

In [17]:
df.head(2) #will show the first two entries.

    name  marks     city
0  harry     92  kolkata
1  rohan     34    delhi

In [18]:
df.tail(2) #will show the last two

     name  marks        city
2  skillf     12      mumbai
3   shubh     76  aurangabad

In [21]:
df.describe() # Will calcculate the standard deviation,mean etc of all the numerical values.

           marks
count   4.000000
mean   53.500000
std    36.927858
min    12.000000
25%    28.500000
50%    55.000000
75%    80.000000
max    92.000000

In [25]:
newton=pd.read_csv('Newtan.csv') #read from csv file.

In [28]:
newton['distance'][1]=40

C:\Users\Newtan\AppData\Local\Temp/ipykernel_3476/3974474628.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newton['distance'][1]=40

In [29]:
newton

  surname  distance        area
0   harry        92     kolkata
1   rohan        40       delhi
2  skillf        12      mumbai
3   shubh        76  aurangabad

In [31]:
newton.to_csv('Newtan.csv',index=False)

# change index title to something else

In [33]:
newton.index=['first','second','third','fourth']

# Use of numpy to make the dataframe

In [38]:
newdf=pd.DataFrame(np.random.rand(336,5),index=np.arange(336))

In [40]:
type(newdf)

pandas.core.frame.DataFrame

In [41]:
newdf.describe()

                0           1           2           3           4
count  336.000000  336.000000  336.000000  336.000000  336.000000
mean     0.510731    0.497219    0.474760    0.492583    0.494060
std      0.298710    0.291787    0.288820    0.286721    0.288870
min      0.010792    0.001448    0.000818    0.003347    0.001122
25%      0.246655    0.234819    0.235630    0.234750    0.249267
50%      0.521568    0.496608    0.456995    0.481859    0.486732
75%      0.786005    0.743405    0.720408    0.744030    0.751234
max      0.996225    0.998271    0.996745    0.999350    0.999448

In [48]:
newdf=newdf.rename(columns={'new':'newton'}) # Rename the column name to something else.

In [52]:
newdf['newton'][0]='example'

In [54]:
newdf.head()

     newton         1         2         3         4
0   example  0.531152  0.334151  0.158317  0.337828
1  0.222044  0.068515  0.977235  0.297188  0.996942
2    0.6448  0.247417  0.767831  0.372679  0.040176
3  0.162428  0.452127  0.142193  0.632288  0.089867
4  0.053416  0.937112  0.335629  0.869446  0.293420

In [55]:
newdf.dtypes

newton     object
1         float64
2         float64
3         float64
4         float64
dtype: object

In [56]:
newdf.columns

Index(['newton', 1, 2, 3, 4], dtype='object')

In [57]:
newdf['newton'][0]=2

# converting from dataframe tio numpy format

In [58]:
newdf.to_numpy()

array([[2, 0.5311517891212216, 0.33415144877230596, 0.15831710496903206,
        0.3378281773224563],
       [0.22204380487953235, 0.06851499847701192, 0.9772346936005041,
        0.2971881416874296, 0.9969423840899676],
       [0.644799577512262, 0.24741688019350638, 0.7678308534791995,
        0.3726792999609523, 0.040175917416776064],
       ...,
       [0.9008526109075282, 0.720918410294082, 0.3966757561612685,
        0.3002497663796989, 0.13176848538188912],
       [0.1362622221704305, 0.7607610455673315, 0.5559653397778794,
        0.19650253368541204, 0.14860251575800254],
       [0.03349417210309036, 0.17861240927412647, 0.7681189510810519,
        0.21174717560728729, 0.5794978052775954]], dtype=object)